# Вычислить число c заданной точностью d

# Пример:

# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$

import math

num=input("введите точность числа ПИ (d), пример(0.001): ")
pic = math.pi

lenn=(len(num))-2
print(f'при d = {num}, ПИ={round(pic,lenn)}')
